// const emojis = `😡🤬🥵👹👺💄💋💃👠⛑️👞🎒🐞🦑🦐🦞🦀🍄🌹🥀🍎🍓🍒🍅🌶️🥩🥫🍫🍿🍷🥢🏓🏒🥅🥊🛷⛹️‍♀️🚣🎟️🎪🥁🎸🎯🚗🏎️🚒🚨🚘🚠🚂🚁🚢⛽️🗼🎡⛩️☎️⏰🧯🛢️🧰🧱🧲🧨🪓🛡️📿🩸🌡️✂️🖍️❤️💔❤️‍🔥❤️‍🩹❣️💮🉐㊙️㊗️🈴🈵🈹🈲🅰️🅱️🆎🆑🅾️🆘❌⭕️🛑⛔️📛🚫💯💢♨️🚷🚯🚳🚱🔞📵🚭❗️❓‼️⁉️🔴🔺🔻🟥♥️♦️🎴🚩🎃😡🤬🥵👩‍🦰🧑‍🦰👨‍🦰🧶🦺🩳👘🥻🦊🦁🐡🦧🐅🍂🍁🪸☄️💥🔥🍊🍑🥕🥐🍣🥮🥧🥤🍺🍻🥃🍹🏀🤿🥉🎭🚚⛵️🚤🏜️🌋🏕️⛺️🌅🌄🎇🌇🌆🏺🪒🎁🎊🏮📙🧡🉑☢️☣️📴📳🈶🈚️🈸🈺🈷️✴️🆚🚼🟠🔸🔶🟧😀😃😄😁😆☺️😊😇🙂🙃😉😌😍🥰😘😗😙😚😋😛😗😙😚😋😛😝😜🤪🤨🧐🤓😎🤩🥳😏😒😞😔😟😕🙁☹️😣😖😫😩🥺😢😭😤😠🤯😳😱😨😰😥😓🤗🤔🤭🤞✌️☝️✋🤚🖐️🖖👋🤙💪🖕✍️🙏🦶🦵👂🦻👃👶👧🧒👦👩🧑👨👩‍🦱🧑‍🦱👨‍🦱👱‍♀️👱👱‍♂️👩‍🦰🧑‍🦰👨‍🦰👩‍🦳🧑‍🦳👨‍🦳👩‍🦲🧑‍🦲👨‍🦲🧔‍♀️🧔🧔‍♂️👵🧓👴👲👳‍♀️👳👳‍♂️👷‍♀️👷👷‍♂️👩‍⚕️🧑‍⚕️👨‍⚕️👩‍🌾🧑‍🌾👨‍🌾👩‍🏫🧑‍🏫👨‍🏫👩‍💼🧑‍💼👨‍💼👼💅👯‍♀️👯👯‍♂️🧥👡👢🧦👒👑🐱🐯🐤🐣🐥🐝🐆🌼🌻🌞🌝🌛🌜🌕🌖🌔🪐💫⭐️🌟✨⚡️☀️🌤️🍌🌽🧀🧁🍰🍯🥂🏸🎿🤼‍♀️🤼🤼‍♂️🏆🥇🏅🎖️🏵️🎗️🎫🎷🎺🚕🚌🚜🛵🛺🚖🚡🚟🚡🚧🎢⛱️🏖️🏝️🏗️🌠💡💰💳⚱️💊🧽🛎️🔑🖼️🎉📯📒✏️💛🔅🔆〽️⚠️🚸🔱⚜️🟡🟨🔔🔕📣🤢🤮🧑‍🎤🩲🧤🐸🐛🐢🐍🦎🦖🐊🦚🦜🐉🐲🌵🎄🌲🌳🌴🌱🌿☘️🍀🎍🎋🍃🌾🍏🍐🍈🥝🥦🥬🥒🥑🧃🍾🥎🎾🪀⛳️🧩🚛🚃🚞🛣️🏞️📟🔋💸💵💴💶🔫🦠🧪📗📚💚🔰♻️✅🈯️💹❇️✳️❎🟢🟩🥶🤖🗣️👤👥👮‍♀️👮👮‍♂️👨‍🎤👩‍🏭🧑‍🏭👨‍🏭🧞‍♂️👩‍🔧🧑‍🔧👨‍🔧👩‍🔬🧑‍🔬👨‍🔬💁‍♂️🙅‍♂️🙆‍♂️🧵👕👖👔👗🩱🥿🧢👓💍🦋🦕🐠🐟🐬🐳🐋🦈🌚🌑🌘🌒🌎🌍🌏❄️💧💦🌊🧊🥣🥏🥍🪁🎣🎽⛷️🏂⛹️‍♂️🎭🚙🚎🛴🚲🚝🚄🚅🚈🚆🚇🚊🚉✈️🛫🛬🛩️💺🛰️🛸⛴️🗺️🚀🗽⛲️🗾🎑🏞️🌠🏙️🌃🌌🌉🌁💎💈⚗️🛋️🛏️🛌🎏🎎🎐📥📤📪📫📬📭🗳️📘📖🖌️Ⓜ️🌀💤🏧🚾♿️🅿️🈂️🛂🛃🛄🛅🚹⚧️🚻🚮🎦📶🈁🔣ℹ️🔤🔡🔠🆖🆗🆙🆒🆕🆓0️⃣1️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟🔢#️⃣*️⃣⏏️▶️⏸️⏯️⏹️⏺️⏭️⏮️⏩️⏪️⏫️⏬️◀️🔼🔽➡️⬅️⬆️⬇️↗️↘️↙️↖️↕️↔️↪️↩️⤴️⤵️🔀🔁🔂🔄🔃🔵🔹🔷🟦😈👿👾🧕👩‍🎤🦸‍♀️🦸🦸‍♂️🦹‍♀️🦹🦹‍♂️🧞🤰💁‍♀️🙅‍♀️🙆‍♀️🕺🌂🦄☂️☔️🍇🍆💷🧬💜💟☮️✝️☪️🕉️☸️🪯✡️🔯🕎☯️☦️🛐⛎♈️♉️♊️♋️♌️♍️♎️♏️♐️♑️♒️♓️🆔⚛️🚺🟣🟪👄👅🧠🧞‍♀️👚👙🐷🐽🐙🦩🌺🌸💐🌷🍠🍬🩰🏩💒🔮🧫🛍️🎀🩷💕💞💓💗💖💘💝😶‍🌫️🤡👻💀☠️🦷👁️👀👩‍🦳🧑‍🦳👨‍🦳👳‍♀️👳👳‍♂️👩‍🍳🧑‍🍳👨‍🍳🥼👟🥽🐶🐹🐼🐻‍❄️🐮🐔🕸️🐄🐏🐑🐩🦙🐓🦢🐈🕊️🐇🪶🐁🐚⛅️🌥️☁️🌦️🌧️⛈️🌩️🌨️⛄️☃️🌬️🧄🥚🦴🍝🍜🍲🍛🍙🍚🍥🍧🍨🍦🎂🍮🥛🍼☕️🍵🍶🍽️🥡🧂⚽️⚾️🏐🥋⛸️🤺🎹🎲🎳🎰🚞🛟🛥️🛳️🎠🏥⛪️🌁🧭⏱️⏲️📡🕯️🚬🔭🩹🧻🚽🛁🛀🧴✉️📩📨📧💌📃📄📑🧾📊📈📉🗒️🗓️📆📅📇📋🗞️📰🔖📝🤍❕❔⚪️▫️◽️◻️⬜️🔳📢💬💭🗯️🃏🀄️🕐🕑🕒🕓🕔🕕🕖🕗🕘🕙🕚🕛🕜🕝🕞🕟🕠🕡🕢🕣🕤🕥🕦🕧🏳️👽🦾🦿🕵️‍♀️🕵️🕵️‍♂️👩‍💻🧑‍💻👨‍💻💁🙅🙆🙋🏻🤳💍🐭🐰🐨🐦🐺🦄🦈🦍🐘🦓🦛🦏🦝🦡🐀💽💾💿📀📹📽️🎞️📠🎙️🎚️🎛️🔦⚖️🔧🔩⚙️⛓️🔪🗡️⚔️🗑️🗄️📁📂📓🧷🔗📎🖇️📐📏🔍🔎🔏🔐🔒🔓🩶☑️🔘🔈🔇🔉🔊🏁👣💂‍♀️💂💂‍♂️👩‍🎓🧑‍🎓👨‍🎓🕴️🎩🎓🕶️🐧🐦‍⬛🦅🐜🕷️🐕‍🦺🐈‍⬛🦨🐃🐾🍳🎱🥌🏋️🎬🎤🎼♟️🎮🚓🦽🦼🛞🚔🚦🚥🕋⌚️📱📲🖲️🕹️📼📷📸🎥📞🔌🔨⚒️🛠️⛏️💣🕳️🪮🗝️🪄🗃️🖊️🖋️✒️🖤🎵🎶➕➖➗✖️🟰♾️💲💱™️©️®️👁️‍🗨️🔚🔙🔛🔝🔜〰️➰➿✔️⚫️▪️◾️◼️⬛️🔲♠️♣️🏴🏴‍☠️`

const emojisBasic = [`😡`, `🤬`, `🥵`, `👹`, `👺`, `💄`, `💋`, `💃`, `👠`, `⛑️`, `👞`, `🎒`, `🐞`, `🦑`, `🦐`, `🦞`, `🦀`, `🍄`, `🌹`, `🥀`, `🍎`, `🍓`, `🍒`, `🍅`, `🥩`, `🍫`, `🏓`, `🌶️`, `🩸`];

const container = document.getElementById("container");

const maxCols = Math.floor(window.innerWidth / 20);
const maxRows = Math.floor(container.offsetHeight / 20);

const col = 2 * (maxCols > 30 ? 30 : maxCols);
const offset = maxCols > 30 ? 0 : Math.floor((30 - maxCols) / 2);
const row = 2 * (maxRows - 2);

const repeat = 50;
let emojis = [];

while (emojis.length < col * row) {
  emojis = emojis.concat(emojisBasic.slice(0, col - 1));
}

const invertedSpans = [
  [4, 8], [4, 9], [4, 10], [4, 11],
  [4, 18], [4, 19], [4, 20], [4, 21],
  [5, 7], [5, 8], [5, 12], [5, 13],
  [5, 16], [5, 17], [5, 21], [5, 22],
  [6, 6], [6, 7], [6, 13], [6, 14],
  [6, 15], [6, 16], [6, 22], [6, 23],
  [7, 5], [7, 6], [7, 14],
  [7, 15], [7, 23], [7, 24],
  [8, 5], [8, 6], [8, 14],
  [8, 15], [8, 23], [8, 24],
  [9, 6], [9, 7], [9, 13], [9, 14],
  [9, 15], [9, 16], [9, 22], [9, 23],
  [10, 7], [10, 8], [10, 12], [10, 13],
  [10, 16], [10, 17], [10, 21], [10, 22],
  [11, 8], [11, 9], [11, 10], [11, 11],
  [11, 18], [11, 19], [11, 20], [11, 21],
];

const invertContainer = document.getElementById("invert-container");

function createInverts(style, invert, container) {
  const span = document.createElement("span");
  span.classList.add(style);
  span.style.top = `${25 * (invert[0] - 1)}px`;
  span.style.left = `${-83 + 18 * invert[1]}px`;
  container.append(span);
}

invertedSpans.forEach(invert => {
  createInverts("inverted", invert, invertContainer)
})

const antiInvertContainer = document.getElementById("anti-invert-container");

invertedSpans.forEach(invert => {
  createInverts("anti-inverted", invert, antiInvertContainer)
})

const paradeSpans = [];
const parade = document.getElementById("parade");

parade.style.height = container.offsetHeight + "px";

const backgroundContainer = document.getElementById("background-container");

backgroundContainer.style.height = container.offsetHeight + "px";
container.style.minHeight = "100%";

const submitButton = document.getElementById("submit-button");
const emailButton = document.getElementById("email-button");
const antiSubmitButton = document.getElementById("anti-button");
const antiEmailButton = document.getElementById("anti-email-button");

let submitLocation = submitButton.getBoundingClientRect();
let emailLocation = emailButton.getBoundingClientRect();

antiSubmitButton.style.top = submitLocation.top;
antiEmailButton.style.top = emailLocation.top;